In [3]:
import numpy as np
import pandas as pd

In [4]:
columns = ['W', 'X', 'Y', 'Z']

In [5]:
index = ['A', 'B', 'C', 'D', 'E']

In [6]:
from numpy.random import randint

In [7]:
np.random.seed(42)
data = randint(-100, 100, (5,4))

In [8]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [9]:
 df = pd.DataFrame(data, index, columns)

In [10]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [11]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [12]:
df[['W', 'Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [13]:
df['new'] = df['W'] + df['Y']

In [14]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [15]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [16]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [17]:
df.loc['A']

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [18]:
df.loc[['A', 'B']]

   W   X   Y   Z  new
A  2  79  -8 -86   -6
B  6 -29  88 -80   94

In [19]:
df.iloc[0:3]

   W   X   Y   Z  new
A  2  79  -8 -86   -6
B  6 -29  88 -80   94
C  2  21 -26 -13  -24

In [21]:
df.loc['A', 'W']

2

In [22]:
df.loc[['A', 'B'],['W', 'Y']]

   W   Y
A  2  -8
B  6  88

In [24]:
df[df > 0]

    W     X     Y     Z   new
A   2  79.0   NaN   NaN   NaN
B   6   NaN  88.0   NaN  94.0
C   2  21.0   NaN   NaN   NaN
D  16   NaN   3.0  51.0  19.0
E  30  49.0   NaN   NaN   NaN

In [25]:
df['X']

A    79
B   -29
C    21
D    -1
E    49
Name: X, dtype: int64

In [26]:
df['X']> 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [27]:
df[df['X']>0]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
C   2  21 -26 -13  -24
E  30  49 -48 -99  -18

In [28]:
df[df['X']>0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

In [30]:
df[(df['W']>0) | (df['Y']> 1)]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [31]:
df.reset_index()

  index   W   X   Y   Z  new
0     A   2  79  -8 -86   -6
1     B   6 -29  88 -80   94
2     C   2  21 -26 -13  -24
3     D  16  -1   3  51   19
4     E  30  49 -48 -99  -18

In [32]:
new_ind = ['NY', 'CI', 'WY', 'OR', 'CO']

In [33]:
df['States'] = new_ind

In [34]:
df

    W   X   Y   Z  new States
A   2  79  -8 -86   -6     NY
B   6 -29  88 -80   94     CI
C   2  21 -26 -13  -24     WY
D  16  -1   3  51   19     OR
E  30  49 -48 -99  -18     CO

In [35]:
df.set_index('States')

         W   X   Y   Z  new
States
NY       2  79  -8 -86   -6
CI       6 -29  88 -80   94
WY       2  21 -26 -13  -24
OR      16  -1   3  51   19
CO      30  49 -48 -99  -18

In [36]:
 df.describe()

              W          X          Y          Z        new
count   5.00000   5.000000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000  13.000000
std    11.96662  42.109381  51.915316  63.366395  48.187135
min     2.00000 -29.000000 -48.000000 -99.000000 -24.000000
25%     2.00000  -1.000000 -26.000000 -86.000000 -18.000000
50%     6.00000  21.000000  -8.000000 -80.000000  -6.000000
75%    16.00000  49.000000   3.000000 -13.000000  19.000000
max    30.00000  79.000000  88.000000  51.000000  94.000000